# Cask apps
tap "homebrew/cask"
cask "docker"
cask "google-chrome"
cask "iterm2"
cask "leapp"
cask "session-manager-plugin"
cask "setapp"
cask "slack"
cask "zoom"
cask "aws-vpn-client"

# Core packages
brew "coreutils"
brew "curl"
brew "git"
brew "python"
brew "jq"
brew "yq"
# brew "asdf"
brew "make"
brew "atmos"
brew "awscli"
brew "terraform"
brew "go"

# Personalization
brew "zsh-syntax-highlighting"
brew "nvim"
brew "tree"

# Linting/TF packages
brew "pre-commit"
brew "terraform-docs"
brew "tflint"
brew "tfsec"
brew "checkov"
brew "terrascan"
brew "infracost"
brew "tfupdate"
brew "adr-tools"
brew "detect-secrets"
brew "actionlint"
brew "typos-cli"
brew "reviewdog/tap/reviewdog"

brew "vhs"
