# Cask apps
#tap "homebrew/cask"

# Dev essential
cask "slack"
cask "zoom"
cask "aws-vpn-client"
#cask "docker"
cask "orbstack"
cask "iterm2"
# cask "wave"
cask "warp"

# Browsers
cask "google-chrome"
cask "arc"

# Cloud Posse
cask "leapp"
cask "session-manager-plugin"
cask "1password"

# Other
cask "setapp"
cask "logseq"
cask "discord"
cask "spotify"
cask "amethyst"

# Core packages
brew "coreutils"
brew "curl"
brew "git"
brew "python"
brew "jq"
brew "yq"
brew "make"

# Core tools
brew "atmos"
brew "awscli"
brew "gh"
brew "leapp-cli"

# Languages
brew "terraform"
brew "go"
brew "npm"
brew "nvm"
brew "python@3.10" # docs versions

# Personalization
brew "zsh-syntax-highlighting"
brew "nvim"
brew "tree"

# Linting/TF packages
brew "pre-commit"
brew "terraform-docs"
brew "tflint"
brew "tfsec"
brew "checkov"
brew "terrascan"
brew "infracost"
brew "tfupdate"
brew "adr-tools"
brew "detect-secrets"
brew "actionlint"
brew "typos-cli"
brew "reviewdog/tap/reviewdog"

# Misc. helpers
brew "vhs"
brew "mdless"
brew "bat"
brew "prettier"
