# Cask apps
tap "homebrew/cask"
cask "zoom"
cask "google-chrome"
cask "leapp"
cask "iterm2"
cask "docker"
cask "slack"
cask "setapp"

# Core packages
brew "coreutils"
brew "curl"
brew "git"
brew "python"
brew "jq"
# brew "asdf"

# Personalization
brew "zsh-syntax-highlighting"
brew "nvim"
brew "tree"

# Linting/TF packages
brew "pre-commit"
brew "terraform-docs" 
brew "tflint"
brew "tfsec"
brew "checkov"
brew "terrascan"
brew "infracost"
brew "tfupdate"
brew "adr-tools"
